[
  {
    "arabic": "أستغفر الله",
    "transliteration": "Astaghfirullah",
    "meaning": "I seek forgiveness from Allah."
  },
  {
    "arabic": "أستغفر الله وأتوب إليه",
    "transliteration": "Astaghfirullah wa atubu ilayh",
    "meaning": "I seek forgiveness from Allah and turn to Him in repentance."
  },
  {
    "arabic": "أستغفر الله ربي من كل ذنب وأتوب إليه",
    "transliteration": "Astaghfirullah Rabbi min kulli dhambin wa atubu ilayh",
    "meaning": "I seek forgiveness from Allah for every sin and I repent to Him."
  },
  {
    "arabic": "رَبِّ اغْفِرْ لِي وَتُبْ عَلَيَّ",
    "transliteration": "Rabbi ighfir li wa tub ‘alayya",
    "meaning": "My Lord, forgive me and accept my repentance."
  },
  {
    "arabic": "لَا إِلَٰهَ إِلَّا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ",
    "transliteration": "La ilaha illa Anta, subhanaka inni kuntu minaz-zalimin",
    "meaning": "There is no deity but You; glory be to You, I was among the wrongdoers."
  },
  {
    "arabic": "أستغفر الله الذي لا إله إلا هو الحي القيوم وأتوب إليه",
    "transliteration": "Astaghfirullaha alladhi la ilaha illa huwa al-hayyul qayyoom wa atubu ilayh",
    "meaning": "I seek forgiveness from Allah, there is no god but He, the Ever-Living, the Sustainer."
  },
  {
    "arabic": "اللَّهُمَّ أَنْتَ رَبِّي، لَا إِلَهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَىٰ عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ بِذَنْبِي، فَاغْفِرْ لِي، فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",
    "transliteration": "Allahumma Anta Rabbi, la ilaha illa Anta, khalaqtani wa ana ‘abduka, wa ana ‘ala ‘ahdika wa wa’dika mastata’tu, a’udhu bika min sharri ma sana’tu, abu’u laka bini’matika ‘alayya, wa abu’u bidhanbi, faghfir li fa innahu la yaghfirudh-dhunuba illa Anta.",
    "meaning": "O Allah! You are my Lord. There is no true deity except You. You created me and I am Your servant. I seek refuge in You from the evil of what I have done. I acknowledge Your blessings upon me and I confess my sins to You. So forgive me, for surely no one can forgive sins except You."
  }
]
